Emacs.org
#+title: Emacs Config
#+author: Ryan Denby
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

* Intro

My configuration file for emacs, this file when saved will automatically generate the init.el file

Below we will define some default values to be used throughout the config

#+begin_src emacs-lisp

  ;; native comp
  ;; run (byte-recompile-directory package-user-dir nil 'force) on fresh install
  (setq comp-deferred-compilation t)
  (setq comp-speed 3)
  (setq comp-async-report-warnings-errors nil)
  (setq warning-minimum-level :error)

  ;; Set default font size values
  (defvar efs/default-font-size 150)
  (defvar efs/default-variable-font-size 150)

  ;; Set default transparency values
  (defvar efs/frame-transparency '(100 . 100))

#+end_src

* Startup Performance

Tracks performace of config on startup, useful to see if it is taking too long for the config to load, as it could indicate that there is issues with a package etc

#+begin_src emacs-lisp

  ;; The default is 800 kilobytes.  Measured in bytes.
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun efs/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                       (time-subtract after-init-time before-init-time)))
             gcs-done))

  (add-hook 'emacs-startup-hook #'efs/display-startup-time)
  (server-force-delete)
  (server-start)

#+end_src

* Package System Setup

Define package archives where we will pull up the packages for the config

#+begin_src emacs-lisp

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

    ;; Initialize use-package on non-Linux platforms (incase I ever use emacs on windows)
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Straight.el

Package management

#+begin_src emacs-lisp
  ;; Bootstrap straight.el
  (defvar bootstrap-version)
  (let ((bootstrap-file
        (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
        (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
          "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
          'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  ;; Always use straight to install on systems other than Linux
  (setq straight-use-package-by-default (not (eq system-type 'gnu/linux)))

  ;; Use straight.el for use-package expressions
  (straight-use-package 'use-package)

  ;; Load the helper package for commands like `straight-x-clean-unused-repos'
  (require 'straight-x)

#+end_src

** Automatic Package Updates

Checks all packages for updates when emacs is started, good to keep packages up to date to avoid any issues with speed etc

Force emacs to check for updates while open by using M-x auto-package-update-now

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))

#+end_src

* Keep Folders Clean

Keeps folders where you are using emacs clean

#+begin_src emacs-lisp

  (use-package no-littering)

  ;; Disable auto saving and backups and symbolic link files
  (setq make-backup-files nil)
  (setq auto-save-default nil)
  (setq create-lockfiles nil)

#+end_src

* Basic UI Configuration

** Dashboard

Simple main menu, with a list of recent files and projects

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :config
      (dashboard-setup-startup-hook)
      (setq dashboard-startup-banner 'official)
      (setq dashboard-items '((recents  . 5)
                              (projects . 5)))
      (setq dashboard-banner-logo-title ""))
#+end_src

** General emacs ui config

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        

  (menu-bar-mode -1)            ; Disable the menu bar

  (column-number-mode)
  (global-display-line-numbers-mode t) ; Line numbers

  ;; y or n instead of yes or no
  (defalias 'yes-or-no-p 'y-or-n-p)

  ;; Set frame transparency
  (set-frame-parameter (selected-frame) 'alpha efs/frame-transparency)
  (add-to-list 'default-frame-alist `(alpha . ,efs/frame-transparency))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))

  ;; Disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  ;; Better scrolling
  (setq scroll-conservatively 100)

#+end_src

** Switch Panes

Logical way of navigating between panes in a buffer, no spamming C-x o to cycle panes

#+begin_src emacs-lisp
  (use-package switch-window
    :ensure t
    :config
      (setq switch-window-input-style 'minibuffer)
      (setq switch-window-increase 4)
      (setq switch-window-threshold 2)
      (setq switch-window-shortcut-style 'qwerty)
      (setq switch-window-qwerty-shortcuts
          '("a" "s" "d" "f" "j" "k" "l" "i" "o"))
    :bind
      ([remap other-window] . switch-window))
#+end_src

** Follow splits

Cursor will jump to a pane when you make a new split

#+begin_src emacs-lisp
  (defun split-and-follow-horizontally ()
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

  (defun split-and-follow-vertically ()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+end_src

** Font Configuration

Config for font, using font variable defined at start of config

#+begin_src emacs-lisp

  (set-face-attribute 'default nil :font "Source Code Pro" :height efs/default-font-size)

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "Source Code Pro" :height efs/default-font-size)

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Source Code Pro" :height efs/default-variable-font-size :weight 'regular)

#+end_src

* UI Configuration
** Color Theme

Theme, stuff

#+begin_src emacs-lisp

  (add-to-list 'custom-theme-load-path "~/.emacs.d/themes")

  ;; (use-package ample-theme
  ;;   :init
  ;;   (load-theme 'ample t))

  (load-theme 'desert t)

  (set-foreground-color "#c5c8c6")
  (set-background-color "#1d1f21")


  ;; For the default theme
  (custom-set-faces
   '(company-preview
     ((t (:background "#1d1f21" :foreground "white" :underline t))))
   '(company-preview-common
     ((t (:inherit company-preview))))
   '(company-tooltip
     ((t (:background "#1d1f21" :foreground "white"))))
   '(company-tooltip-selection
     ((t (:background "steelblue" :foreground "white"))))
   )

#+end_src

** Better Modeline

Modeline from doom as it is simple and clean, as the default one is pretty useless 

#+begin_src emacs-lisp

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

#+end_src

** Diminish

Hide minor modes

#+begin_src emacs-lisp
  (use-package diminish)
#+end_src

** Which Key

Will provide possible key combinations for you after a prefix, useful if you can remember the full command

#+begin_src emacs-lisp

  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 1))

#+end_src

** Ivy and Counsel and Avy

Ivy is a completion framework, can be used for everything, mainly use it for files etc

[[https://github.com/Yevgnen/ivy-rich][ivy-rich]] adds extra columns to a few of the Counsel commands to provide more information about each item.

#+begin_src emacs-lisp

    (use-package ivy
      :diminish
      :bind (("C-s" . swiper)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)
             :map ivy-switch-buffer-map
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1))

    (use-package ivy-rich
      :after ivy
      :init
      (ivy-rich-mode 1))

    (use-package counsel
      :bind (("C-M-j" . 'counsel-switch-buffer)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
      :custom
      (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
      :config
      (counsel-mode 1))

  (use-package avy
    :ensure t
    :bind
      ("M-s" . avy-goto-char)
      ("M-m" . avy-goto-word-0))

#+end_src

