Emacs.org
* Rebinds And Custom Commands

#+begin_src emacs-lisp

  (defun copy-word ()
    (interactive)
    (save-excursion
      (forward-char 1)
      (backward-word)
      (kill-word 1)
      (yank)))

  (defun smart-beginning-of-line ()
    (interactive)
    (let ((oldpos (point)))
      (back-to-indentation)
      (and (= oldpos (point))
           (beginning-of-line))))

  (defun shift-text (distance)
    (if (use-region-p)
        (let ((mark (mark)))
          (save-excursion
            (indent-rigidly (region-beginning)
                            (region-end)
                            distance)
            (push-mark mark t t)
            (setq deactivate-mark nil)))
      (indent-rigidly (line-beginning-position)
                      (line-end-position)
                      distance)))

  (defun shift-right (count)
    (interactive "p")
    (shift-text count))

  (defun shift-left (count)
    (interactive "p")
    (shift-text (- count)))

  (defun aborn/backward-kill-word ()
    "Customize/Smart backward-kill-word."
    (interactive)
    (let* ((cp (point))
           (backword)
           (end)
           (space-pos)
           (backword-char (if (bobp)
                              ""           ;; cursor in begin of buffer
                            (buffer-substring cp (- cp 1)))))
      (if (equal (length backword-char) (string-width backword-char))
          (progn
            (save-excursion
              (setq backword (buffer-substring (point) (progn (forward-word -1) (point)))))
            (setq ab/debug backword)
            (save-excursion
              (when (and backword          ;; when backword contains space
                         (s-contains? " " backword))
                (setq space-pos (ignore-errors (search-backward " ")))))
            (save-excursion
              (let* ((pos (ignore-errors (search-backward-regexp "\n")))
                     (substr (when pos (buffer-substring pos cp))))
                (when (or (and substr (s-blank? (s-trim substr)))
                          (s-contains? "\n" backword))
                  (setq end pos))))
            (if end
                (kill-region cp end)
              (if space-pos
                  (kill-region cp space-pos)
                (backward-kill-word 1))))
        (kill-region cp (- cp 1)))         ;; word is non-english word
      ))

  (defun custom-avy-copy-line ()
    (interactive)
    (save-excursion
      (avy-goto-line)
      (back-to-indentation)
      (kill-line)
      (yank)))

  (global-set-key (kbd "C-c w") #'copy-word)
  (global-set-key (kbd "C-c l") #'custom-avy-copy-line)
  (global-set-key (kbd "C-x C-b") #'switch-to-buffer)
  (global-set-key (kbd "C-a") #'smart-beginning-of-line)
  (global-set-key (kbd "M-[") #'shift-right)
  (global-set-key (kbd "M-]") #'shift-left)
  (global-set-key [C-backspace] #'aborn/backward-kill-word)

#+end_src
